---
kind: method
id: M:Autodesk.Revit.UI.Macros.UIMacroManager.Dispose
source: html/65db2761-d588-ee8f-220f-a5ec1e24a710.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager.Dispose Method

Releases all resources used by the UIMacroManager

## Syntax (C#)
```csharp
public void Dispose()
```